<?php

error_reporting(-1);
//----------------------------------------------------------------------------------------------------------------------------------//
echo "Задача на проверку номера телефона:<br>";
$inputData = array(
    '8-(911)-506 56 56',
    '8-911-50-656-56', //ой, в пизду этот номер, только дауны так будут набирать. Я заебался, голова даже заболела от этой хуйни.
    '89115065656',
    '02',
    '89115065656 позвать Люду'
);
$regexp = '/^8( |-|\\(|-\\(| -\\()?([0-9]{3})( |-|\\)|\\)-|\\)- )?([0-9]{3})( |-)?([0-9]{2})( |-)?([0-9]{2})$/';

for ($i = 0; $i <count($inputData); $i++){
    if (preg_match($regexp, $inputData[$i])){
        echo "{$inputData[$i]} - правильный<br>";
    } else {
        echo "{$inputData[$i]} - неправильный<br>";
    }
}

echo "<br><br><br>";
//----------------------------------------------------------------------------------------------------------------------------------//
echo "Grammar Nazi:<br>";//скоро сделаю

